fixture/vcr_cassettes/pay_in/card/direct/create.json

[
  {
    "request": {
      "body": "{\"Tag\":\"custom meta\",\"StatementDescriptor\":\"Mar2016\",\"SecureModeReturnURL\":\"http://www.my-site.com/returnURL\",\"SecureMode\":\"DEFAULT\",\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":550},\"CreditedWalletId\":\"44488734\",\"CardId\":\"44488740\",\"Billing\":{\"Address\":{\"Region\":\"Ile de France\",\"PostalCode\":\"755001\",\"Country\":\"FR\",\"City\":\"Paris\",\"AddressLine2\":\"The Loop\",\"AddressLine1\":\"1 Mangopay Street\"}},\"AuthorId\":\"44488732\"}",
      "headers": {
        "Authorization": "bearer 5dbdeabbc4a0493ab2f56a901339058d",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/payins/card/direct"
    },
    "response": {
      "binary": false,
      "body": "{\"Id\":\"44488753\",\"Tag\":\"custom meta\",\"CreationDate\":1520378961,\"AuthorId\":\"44488732\",\"CreditedUserId\":\"44488732\",\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":550},\"CreditedFunds\":{\"Currency\":\"EUR\",\"Amount\":547},\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"Status\":\"SUCCEEDED\",\"ResultCode\":\"000000\",\"ResultMessage\":\"Success\",\"ExecutionDate\":1520378962,\"Type\":\"PAYIN\",\"Nature\":\"REGULAR\",\"CreditedWalletId\":\"44488734\",\"DebitedWalletId\":null,\"PaymentType\":\"CARD\",\"ExecutionType\":\"DIRECT\",\"SecureMode\":\"DEFAULT\",\"CardId\":\"44488740\",\"SecureModeReturnURL\":null,\"SecureModeRedirectURL\":null,\"SecureModeNeeded\":false,\"StatementDescriptor\":\"Mar2016\"}",
      "headers": {
        "Date": "Tue, 06 Mar 2018 23:29:23 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "630",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=d91922db20d6a2664ed4e36d0fe2505c01520378961; expires=Wed, 06-Mar-19 23:29:21 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "148",
        "X-RateLimit-Remaining": "2152",
        "X-RateLimit-Reset": "1520379840",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "3f789a9fce453c77-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]