fixture/vcr_cassettes/pay_out/create.json

[
  {
    "request": {
      "body": "{\"Tag\":\"custom meta\",\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"DebitedWalletId\":\"44488734\",\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":12},\"BankWireRef\":\"invoice 7282\",\"BankAccountId\":\"44488735\",\"AuthorId\":\"44488732\"}",
      "headers": {
        "Authorization": "bearer 5dbdeabbc4a0493ab2f56a901339058d",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/payouts/bankwire"
    },
    "response": {
      "binary": false,
      "body": "{\"Id\":\"44488760\",\"Tag\":\"custom meta\",\"CreationDate\":1520378977,\"AuthorId\":\"44488732\",\"CreditedUserId\":null,\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":12},\"CreditedFunds\":{\"Currency\":\"EUR\",\"Amount\":9},\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"Status\":\"CREATED\",\"ResultCode\":null,\"ResultMessage\":null,\"ExecutionDate\":null,\"Type\":\"PAYOUT\",\"Nature\":\"REGULAR\",\"CreditedWalletId\":null,\"DebitedWalletId\":\"44488734\",\"PaymentType\":\"BANK_WIRE\",\"BankAccountId\":\"44488735\",\"BankWireRef\":\"invoice 7282\"}",
      "headers": {
        "Date": "Tue, 06 Mar 2018 23:29:37 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "485",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=d8739439958f32c41922804eaf92ce9691520378977; expires=Wed, 06-Mar-19 23:29:37 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "160",
        "X-RateLimit-Remaining": "2140",
        "X-RateLimit-Reset": "1520379840",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "3f789b015f5a3c77-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]