fixture/vcr_cassettes/payouttest/pay_out/create.json

[
  {
    "request": {
      "body": "{\"Tag\":\"custom meta\",\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"DebitedWalletId\":\"47401991\",\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":12},\"BankWireRef\":\"invoice 7282\",\"BankAccountId\":\"47401990\",\"AuthorId\":\"47401984\"}",
      "headers": {
        "Authorization": "bearer 3285b058e0fd4c559221549a3aa5072f",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/payouts/bankwire"
    },
    "response": {
      "binary": false,
      "body": "{\"Id\":\"47401995\",\"Tag\":\"custom meta\",\"CreationDate\":1524259765,\"AuthorId\":\"47401984\",\"CreditedUserId\":null,\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":12},\"CreditedFunds\":{\"Currency\":\"EUR\",\"Amount\":9},\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"Status\":\"CREATED\",\"ResultCode\":null,\"ResultMessage\":null,\"ExecutionDate\":null,\"Type\":\"PAYOUT\",\"Nature\":\"REGULAR\",\"CreditedWalletId\":null,\"DebitedWalletId\":\"47401991\",\"PaymentType\":\"BANK_WIRE\",\"BankAccountId\":\"47401990\",\"BankWireRef\":\"invoice 7282\"}",
      "headers": {
        "Date": "Fri, 20 Apr 2018 21:29:25 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "485",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=d5d8bec124862df3df11ed44a7891e3c71524259765; expires=Sat, 20-Apr-19 21:29:25 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "396",
        "X-RateLimit-Remaining": "1904",
        "X-RateLimit-Reset": "1524260640",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "40eab4cd1bd8b771-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]