fixture/vcr_cassettes/payouttest/wallet/create.json

[
  {
    "request": {
      "body": "{\"Tag\":\"custom meta\",\"Owners\":[\"47401984\"],\"Description\":\"My big project\",\"Currency\":\"EUR\"}",
      "headers": {
        "Authorization": "bearer 3285b058e0fd4c559221549a3aa5072f",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/wallets"
    },
    "response": {
      "binary": false,
      "body": "{\"Description\":\"My big project\",\"Owners\":[\"47401984\"],\"Balance\":{\"Currency\":\"EUR\",\"Amount\":0},\"Currency\":\"EUR\",\"FundsType\":\"DEFAULT\",\"Id\":\"47401991\",\"Tag\":\"custom meta\",\"CreationDate\":1524259761}",
      "headers": {
        "Date": "Fri, 20 Apr 2018 21:29:22 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "195",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=ddfb71065768d26c38d92097745be78051524259761; expires=Sat, 20-Apr-19 21:29:21 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "394",
        "X-RateLimit-Remaining": "1906",
        "X-RateLimit-Reset": "1524260640",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "40eab4b6b8acb771-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]