fixture/vcr_cassettes/preauthorization/create_bis.json

[
  {
    "request": {
      "body": "{\"Tag\":\"custom meta\",\"SecureModeReturnURL\":\"http://www.my-site.com/returnURL\",\"SecureMode\":\"DEFAULT\",\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":5550},\"CardId\":\"44488740\",\"Billing\":{\"Address\":{\"Region\":\"Ile de France\",\"PostalCode\":\"755001\",\"Country\":\"FR\",\"City\":\"Paris\",\"AddressLine2\":\"The Loop\",\"AddressLine1\":\"1 Mangopay Street\"}},\"AuthorId\":\"44488732\"}",
      "headers": {
        "Authorization": "bearer 5dbdeabbc4a0493ab2f56a901339058d",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/preauthorizations/card/direct"
    },
    "response": {
      "binary": false,
      "body": "{\"Id\":\"44488765\",\"Tag\":\"custom meta\",\"CreationDate\":1520378998,\"AuthorId\":\"44488732\",\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":5550},\"AuthorizationDate\":1520378999,\"Status\":\"SUCCEEDED\",\"PaymentStatus\":\"WAITING\",\"ExpirationDate\":1520940599,\"PayInId\":null,\"ResultCode\":\"000000\",\"ResultMessage\":\"Success\",\"SecureMode\":\"DEFAULT\",\"CardId\":\"44488740\",\"SecureModeReturnURL\":null,\"SecureModeRedirectURL\":null,\"SecureModeNeeded\":false,\"PaymentType\":\"CARD\",\"ExecutionType\":\"DIRECT\",\"StatementDescriptor\":null}",
      "headers": {
        "Date": "Tue, 06 Mar 2018 23:29:59 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "499",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=d5ea0b4ed62aab7242b1c7b81c19f14941520378998; expires=Wed, 06-Mar-19 23:29:58 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "180",
        "X-RateLimit-Remaining": "2120",
        "X-RateLimit-Reset": "1520379840",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "3f789b858acd3c77-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]