fixture/vcr_cassettes/refund/get.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "bearer 5dbdeabbc4a0493ab2f56a901339058d",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/refunds/44488759"
    },
    "response": {
      "binary": false,
      "body": "{\"Id\":\"44488759\",\"Tag\":\"custom meta\",\"CreationDate\":1520378976,\"AuthorId\":\"44488732\",\"CreditedUserId\":null,\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":450},\"CreditedFunds\":{\"Currency\":\"EUR\",\"Amount\":447},\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"Status\":\"SUCCEEDED\",\"ResultCode\":\"000000\",\"ResultMessage\":\"Success\",\"ExecutionDate\":1520378976,\"Type\":\"PAYOUT\",\"Nature\":\"REFUND\",\"InitialTransactionId\":\"44488753\",\"InitialTransactionType\":\"PAYIN\",\"InitialTransactionNature\":\"REGULAR\",\"DebitedWalletId\":\"44488734\",\"CreditedWalletId\":null,\"RefundReason\":{\"RefundReasonMessage\":null,\"RefundReasonType\":\"INITIALIZED_BY_CLIENT\"}}",
      "headers": {
        "Date": "Tue, 06 Mar 2018 23:29:41 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "613",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=d881059c99cdc7293bb388418e41bddbb1520378981; expires=Wed, 06-Mar-19 23:29:41 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "166",
        "X-RateLimit-Remaining": "2134",
        "X-RateLimit-Reset": "1520379840",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "3f789b190fdd3c77-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]