fixture/vcr_cassettes/refund/pay_in/all.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "bearer 5dbdeabbc4a0493ab2f56a901339058d",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/payins/44488753/refunds"
    },
    "response": {
      "binary": false,
      "body": "[{\"Id\":\"44488759\",\"Tag\":\"custom meta\",\"CreationDate\":1520378976,\"AuthorId\":\"44488732\",\"CreditedUserId\":null,\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":450},\"CreditedFunds\":{\"Currency\":\"EUR\",\"Amount\":447},\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"Status\":\"SUCCEEDED\",\"ResultCode\":\"000000\",\"ResultMessage\":\"Success\",\"ExecutionDate\":1520378976,\"Type\":\"PAYOUT\",\"Nature\":\"REFUND\",\"CreditedWalletId\":null,\"DebitedWalletId\":\"44488734\"}]",
      "headers": {
        "Date": "Tue, 06 Mar 2018 23:29:40 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "424",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=d1e8b430923302910ea18891dbdbacc051520378980; expires=Wed, 06-Mar-19 23:29:40 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "165",
        "X-RateLimit-Remaining": "2135",
        "X-RateLimit-Reset": "1520379840",
        "X-Number-Of-Pages": "1",
        "X-Number-Of-Items": "1",
        "Link": "<https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/payins/44488753/refunds?page=1&per_page=10>; rel=\"first\",<https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/payins/44488753/refunds?page=1&per_page=10>; rel=\"last\"",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "3f789b162ecd3c77-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]