fixture/vcr_cassettes/refund/transfer/all.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "bearer 5dbdeabbc4a0493ab2f56a901339058d",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/transfers/44488755/refunds"
    },
    "response": {
      "binary": false,
      "body": "[{\"Id\":\"44488758\",\"Tag\":\"custom meta\",\"CreationDate\":1520378975,\"AuthorId\":\"44488732\",\"CreditedUserId\":null,\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":497},\"CreditedFunds\":{\"Currency\":\"EUR\",\"Amount\":499},\"Fees\":{\"Currency\":\"EUR\",\"Amount\":-2},\"Status\":\"SUCCEEDED\",\"ResultCode\":\"000000\",\"ResultMessage\":\"Success\",\"ExecutionDate\":1520378975,\"Type\":\"TRANSFER\",\"Nature\":\"REFUND\",\"CreditedWalletId\":\"44488734\",\"DebitedWalletId\":\"44488752\"}]",
      "headers": {
        "Date": "Tue, 06 Mar 2018 23:29:39 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "433",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=dcaee523162f8ba392de0f8432a4fa05d1520378978; expires=Wed, 06-Mar-19 23:29:38 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "162",
        "X-RateLimit-Remaining": "2138",
        "X-RateLimit-Reset": "1520379840",
        "X-Number-Of-Pages": "1",
        "X-Number-Of-Items": "1",
        "Link": "<https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/transfers/44488755/refunds?page=1&per_page=10>; rel=\"first\",<https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/transfers/44488755/refunds?page=1&per_page=10>; rel=\"last\"",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "3f789b0a1a963c77-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]