fixture/vcr_cassettes/refundtest/pay_out/create.json

[
  {
    "request": {
      "body": "{\"Tag\":\"custom meta\",\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"DebitedWalletId\":\"47401934\",\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":12},\"BankWireRef\":\"invoice 7282\",\"BankAccountId\":\"47401933\",\"AuthorId\":\"47401924\"}",
      "headers": {
        "Authorization": "bearer 3285b058e0fd4c559221549a3aa5072f",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/payouts/bankwire"
    },
    "response": {
      "binary": false,
      "body": "{\"Id\":\"47401941\",\"Tag\":\"custom meta\",\"CreationDate\":1524259712,\"AuthorId\":\"47401924\",\"CreditedUserId\":null,\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":12},\"CreditedFunds\":{\"Currency\":\"EUR\",\"Amount\":9},\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"Status\":\"CREATED\",\"ResultCode\":null,\"ResultMessage\":null,\"ExecutionDate\":null,\"Type\":\"PAYOUT\",\"Nature\":\"REGULAR\",\"CreditedWalletId\":null,\"DebitedWalletId\":\"47401934\",\"PaymentType\":\"BANK_WIRE\",\"BankAccountId\":\"47401933\",\"BankWireRef\":\"invoice 7282\"}",
      "headers": {
        "Date": "Fri, 20 Apr 2018 21:28:32 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "485",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=de29049a14bea548dba41e1014163c6b01524259712; expires=Sat, 20-Apr-19 21:28:32 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "323",
        "X-RateLimit-Remaining": "1977",
        "X-RateLimit-Reset": "1524260580",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "40eab381be01b765-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]