fixture/vcr_cassettes/refundtest/refund/dispute/create_bis.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "bearer 3285b058e0fd4c559221549a3aa5072f",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/disputes"
    },
    "response": {
      "binary": false,
      "body": "[{\"InitialTransactionId\":\"9089736\",\"InitialTransactionType\":\"PAYIN\",\"InitialTransactionNature\":\"REGULAR\",\"DisputeType\":\"RETRIEVAL\",\"ContestDeadlineDate\":1453248000,\"DisputedFunds\":{\"Currency\":\"EUR\",\"Amount\":100},\"ContestedFunds\":{\"Currency\":\"EUR\",\"Amount\":10},\"Status\":\"SUBMITTED\",\"StatusMessage\":null,\"DisputeReason\":{\"DisputeReasonMessage\":null,\"DisputeReasonType\":\"DUPLICATE\"},\"ResultCode\":null,\"ResultMessage\":null,\"Id\":\"9089738\",\"Tag\":\"New tag 1523445021\",\"CreationDate\":1445521657,\"RepudiationId\":null},{\"InitialTransactionId\":\"9089740\",\"InitialTransactionType\":\"PAYIN\",\"InitialTransactionNature\":\"REGULAR\",\"DisputeType\":\"RETRIEVAL\",\"ContestDeadlineDate\":1453248000,\"DisputedFunds\":{\"Currency\":\"EUR\",\"Amount\":100},\"ContestedFunds\":{\"Currency\":\"EUR\",\"Amount\":100},\"Status\":\"CLOSED\",\"StatusMessage\":null,\"DisputeReason\":{\"DisputeReasonMessage\":null,\"DisputeReasonType\":\"DUPLICATE\"},\"ResultCode\":\"LOST\",\"ResultMessage\":null,\"Id\":\"9089742\",\"Tag\":null,\"CreationDate\":1445521660,\"RepudiationId\":null},{\"InitialTransactionId\":\"9089744\",\"InitialTransactionType\":\"PAYIN\",\"InitialTransactionNature\":\"REGULAR\",\"DisputeType\":\"RETRIEVAL\",\"ContestDeadlineDate\":1453248000,\"DisputedFunds\":{\"Currency\":\"EUR\",\"Amount\":100},\"ContestedFunds\":{\"Currency\":\"EUR\",\"Amount\":10},\"Status\":\"CLOSED\",\"StatusMessage\":null,\"DisputeReason\":{\"DisputeReasonMessage\":null,\"DisputeReasonType\":\"DUPLICATE\"},\"ResultCode\":\"VOID\",\"ResultMessage\":\"test\",\"Id\":\"9089746\",\"Tag\":null,\"CreationDate\":1445521663,\"RepudiationId\":null},{\"InitialTransactionId\":\"9089748\",\"InitialTransactionType\":\"PAYIN\",\"InitialTransactionNature\":\"REGULAR\",\"DisputeType\":\"RETRIEVAL\",\"ContestDeadlineDate\":1453248000,\"DisputedFunds\":{\"Currency\":\"EUR\",\"Amount\":100},\"ContestedFunds\":{\"Currency\":\"EUR\",\"Amount\":100},\"Status\":\"CLOSED\",\"StatusMessage\":null,\"DisputeReason\":{\"DisputeReasonMessage\":null,\"DisputeReasonType\":\"DUPLICATE\"},\"ResultCode\":\"LOST\",\"ResultMessage\":null,\"Id\":\"9089751\",\"Tag\":null,\"CreationDate\":1445521666,\"RepudiationId\":null},{\"InitialTransactionId\":\"9089753\",\"InitialTransactionType\":\"PAYIN\",\"InitialTransactionNature\":\"REGULAR\",\"DisputeType\":\"RETRIEVAL\",\"ContestDeadlineDate\":1453248000,\"DisputedFunds\":{\"Currency\":\"EUR\",\"Amount\":100},\"ContestedFunds\":{\"Currency\":\"EUR\",\"Amount\":10},\"Status\":\"SUBMITTED\",\"StatusMessage\":null,\"DisputeReason\":{\"DisputeReasonMessage\":null,\"DisputeReasonType\":\"DUPLICATE\"},\"ResultCode\":null,\"ResultMessage\":null,\"Id\":\"9089755\",\"Tag\":null,\"CreationDate\":1445521669,\"RepudiationId\":null},{\"InitialTransactionId\":\"9089757\",\"InitialTransactionType\":\"PAYIN\",\"InitialTransactionNature\":\"REGULAR\",\"DisputeType\":\"RETRIEVAL\",\"ContestDeadlineDate\":1453248000,\"DisputedFunds\":{\"Currency\":\"EUR\",\"Amount\":100},\"ContestedFunds\":{\"Currency\":\"EUR\",\"Amount\":100},\"Status\":\"CLOSED\",\"StatusMessage\":null,\"DisputeReason\":{\"DisputeReasonMessage\":null,\"DisputeReasonType\":\"DUPLICATE\"},\"ResultCode\":\"LOST\",\"ResultMessage\":null,\"Id\":\"9089759\",\"Tag\":null,\"CreationDate\":1445521673,\"RepudiationId\":null},{\"InitialTransactionId\":\"9089822\",\"InitialTransactionType\":\"PAYIN\",\"InitialTransactionNature\":\"REGULAR\",\"DisputeType\":\"RETRIEVAL\",\"ContestDeadlineDate\":1453248000,\"DisputedFunds\":{\"Currency\":\"EUR\",\"Amount\":200},\"ContestedFunds\":{\"Currency\":\"EUR\",\"Amount\":10},\"Status\":\"SUBMITTED\",\"StatusMessage\":null,\"DisputeReason\":{\"DisputeReasonMessage\":null,\"DisputeReasonType\":\"DUPLICATE\"},\"ResultCode\":null,\"ResultMessage\":null,\"Id\":\"9089825\",\"Tag\":null,\"CreationDate\":1445521893,\"RepudiationId\":null},{\"InitialTransactionId\":\"9089851\",\"InitialTransactionType\":\"PAYIN\",\"InitialTransactionNature\":\"REGULAR\",\"DisputeType\":\"RETRIEVAL\",\"ContestDeadlineDate\":1453248000,\"DisputedFunds\":{\"Currency\":\"EUR\",\"Amount\":200},\"ContestedFunds\":{\"Currency\":\"EUR\",\"Amount\":200},\"Status\":\"CLOSED\",\"StatusMessage\":null,\"DisputeReason\":{\"DisputeReasonMessage\":null,\"DisputeReasonType\":\"DUPLICATE\"},\"ResultCode\":\"LOST\",\"ResultMessage\":null,\"Id\":\"9089853\",\"Tag\":\"New tag: 635812075469042956\",\"CreationDate\":1445521987,\"RepudiationId\":null},{\"InitialTransactionId\":\"9179729\",\"InitialTransactionType\":\"PAYIN\",\"InitialTransactionNature\":\"REGULAR\",\"DisputeType\":\"CONTESTABLE\",\"ContestDeadlineDate\":1453680000,\"DisputedFunds\":{\"Currency\":\"EUR\",\"Amount\":200},\"ContestedFunds\":{\"Currency\":\"EUR\",\"Amount\":10},\"Status\":\"SUBMITTED\",\"StatusMessage\":null,\"DisputeReason\":{\"DisputeReasonMessage\":null,\"DisputeReasonType\":\"DUPLICATE\"},\"ResultCode\":null,\"ResultMessage\":null,\"Id\":\"9179732\",\"Tag\":null,\"CreationDate\":1445952845,\"RepudiationId\":\"9179734\"},{\"InitialTransactionId\":\"9179737\",\"InitialTransactionType\":\"PAYIN\",\"InitialTransactionNature\":\"REGULAR\",\"DisputeType\":\"NOT_CONTESTABLE\",\"ContestDeadlineDate\":1453680000,\"DisputedFunds\":{\"Currency\":\"EUR\",\"Amount\":200},\"ContestedFunds\":{\"Currency\":\"EUR\",\"Amount\":200},\"Status\":\"CLOSED\",\"StatusMessage\":null,\"DisputeReason\":{\"DisputeReasonMessage\":null,\"DisputeReasonType\":\"DUPLICATE\"},\"ResultCode\":\"LOST\",\"ResultMessage\":null,\"Id\":\"9179739\",\"Tag\":null,\"CreationDate\":1445952854,\"RepudiationId\":\"9179742\"}]",
      "headers": {
        "Date": "Fri, 20 Apr 2018 21:28:32 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "4981",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=de29049a14bea548dba41e1014163c6b01524259712; expires=Sat, 20-Apr-19 21:28:32 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "324",
        "X-RateLimit-Remaining": "1976",
        "X-RateLimit-Reset": "1524260580",
        "X-Number-Of-Pages": "48",
        "X-Number-Of-Items": "480",
        "Link": "<https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/disputes?page=1&per_page=10>; rel=\"first\",<https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/disputes?page=2&per_page=10>; rel=\"prev\",<https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/disputes?page=48&per_page=10>; rel=\"last\"",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "40eab384c917b765-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]