fixture/vcr_cassettes/refundtest/refund/transfer/all.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "bearer 3285b058e0fd4c559221549a3aa5072f",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/transfers/47401938/refunds"
    },
    "response": {
      "binary": false,
      "body": "[{\"Id\":\"47401939\",\"Tag\":\"custom meta\",\"CreationDate\":1524259709,\"AuthorId\":\"47401924\",\"CreditedUserId\":null,\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":497},\"CreditedFunds\":{\"Currency\":\"EUR\",\"Amount\":499},\"Fees\":{\"Currency\":\"EUR\",\"Amount\":-2},\"Status\":\"SUCCEEDED\",\"ResultCode\":\"000000\",\"ResultMessage\":\"Success\",\"ExecutionDate\":1524259710,\"Type\":\"TRANSFER\",\"Nature\":\"REFUND\",\"CreditedWalletId\":\"47401934\",\"DebitedWalletId\":\"47401935\"}]",
      "headers": {
        "Date": "Fri, 20 Apr 2018 21:28:35 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "433",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=dd63dcbf0056ab86eea4871a7990cdf681524259715; expires=Sat, 20-Apr-19 21:28:35 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "329",
        "X-RateLimit-Remaining": "1971",
        "X-RateLimit-Reset": "1524260580",
        "X-Number-Of-Pages": "1",
        "X-Number-Of-Items": "1",
        "Link": "<https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/transfers/47401938/refunds?page=1&per_page=10>; rel=\"first\",<https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/transfers/47401938/refunds?page=1&per_page=10>; rel=\"last\"",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "40eab394cf28b765-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]