fixture/vcr_cassettes/refundtest/wallet/create.json

[
  {
    "request": {
      "body": "{\"Tag\":\"custom meta\",\"Owners\":[\"47401924\"],\"Description\":\"My big project\",\"Currency\":\"EUR\"}",
      "headers": {
        "Authorization": "bearer 3285b058e0fd4c559221549a3aa5072f",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/wallets"
    },
    "response": {
      "binary": false,
      "body": "{\"Description\":\"My big project\",\"Owners\":[\"47401924\"],\"Balance\":{\"Currency\":\"EUR\",\"Amount\":0},\"Currency\":\"EUR\",\"FundsType\":\"DEFAULT\",\"Id\":\"47401934\",\"Tag\":\"custom meta\",\"CreationDate\":1524259704}",
      "headers": {
        "Date": "Fri, 20 Apr 2018 21:28:24 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "195",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=d3ac43dda26b3e294a2406f919c82ff1d1524259704; expires=Sat, 20-Apr-19 21:28:24 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "316",
        "X-RateLimit-Remaining": "1984",
        "X-RateLimit-Reset": "1524260580",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "40eab352bfc9b765-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]