fixture/vcr_cassettes/refundtest/wallet/create_bis.json

[
  {
    "request": {
      "body": "{\"Tag\":\"custom meta\",\"Owners\":[\"47401931\"],\"Description\":\"My big project\",\"Currency\":\"EUR\"}",
      "headers": {
        "Authorization": "bearer 3285b058e0fd4c559221549a3aa5072f",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/wallets"
    },
    "response": {
      "binary": false,
      "body": "{\"Description\":\"My big project\",\"Owners\":[\"47401931\"],\"Balance\":{\"Currency\":\"EUR\",\"Amount\":0},\"Currency\":\"EUR\",\"FundsType\":\"DEFAULT\",\"Id\":\"47401935\",\"Tag\":\"custom meta\",\"CreationDate\":1524259705}",
      "headers": {
        "Date": "Fri, 20 Apr 2018 21:28:25 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "195",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=d4f1c4a3b1575ce0997f68fe97e3c0b7f1524259705; expires=Sat, 20-Apr-19 21:28:25 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "317",
        "X-RateLimit-Remaining": "1983",
        "X-RateLimit-Reset": "1524260580",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "40eab35499aab765-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]