fixture/vcr_cassettes/reportingtest/reporting/wallet/create.json

[
  {
    "request": {
      "body": "{\"Tag\":\"custom meta\",\"Sort\":\"CreationDate:DESC\",\"Preview\":false,\"Filters\":{\"OwnerId\":\"blabla\",\"MinBalanceCurrency\":\"EUR\",\"MinBalanceAmount\":123,\"MaxBalanceCurrency\":\"EUR\",\"MaxBalanceAmount\":123,\"Currency\":\"EUR\",\"BeforeDate\":1463440221,\"AfterDate\":1431817821},\"DownloadFormat\":\"CSV\",\"Columns\":[\"Id\",\"Tag\",\"CreationDate\",\"Owners\",\"Description\",\"BalanceAmount\",\"BalanceCurrency\",\"Currency\",\"FundsType\"],\"CallbackURL\":\"http://www.my-site.com/callbackURL/\"}",
      "headers": {
        "Authorization": "bearer 3285b058e0fd4c559221549a3aa5072f",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/reports/wallets"
    },
    "response": {
      "binary": false,
      "body": "{\"Id\":\"47401949\",\"CreationDate\":1524259728,\"Tag\":\"custom meta\",\"ReportDate\":null,\"Status\":\"PENDING\",\"DownloadFormat\":\"CSV\",\"DownloadURL\":null,\"CallbackURL\":\"http://www.my-site.com/callbackURL/\",\"ReportType\":\"WALLETS\",\"Sort\":\"CreationDate:DESC\",\"Preview\":false,\"Filters\":{\"BeforeDate\":1463440221,\"AfterDate\":1431817821,\"OwnerId\":\"blabla\",\"Currency\":\"EUR\",\"MinBalanceAmount\":123,\"MinBalanceCurrency\":\"EUR\",\"MaxBalanceAmount\":123,\"MaxBalanceCurrency\":\"EUR\"},\"Columns\":[\"Id\",\"Tag\",\"CreationDate\",\"Owners\",\"Description\",\"BalanceAmount\",\"BalanceCurrency\",\"Currency\",\"FundsType\"],\"ResultCode\":null,\"ResultMessage\":null}",
      "headers": {
        "Date": "Fri, 20 Apr 2018 21:28:48 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "612",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=d154f2fb10577bf5f60682f2d413f325d1524259728; expires=Sat, 20-Apr-19 21:28:48 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "345",
        "X-RateLimit-Remaining": "1955",
        "X-RateLimit-Reset": "1524260580",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "40eab3e7fa0fb771-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]