fixture/vcr_cassettes/transactiontest/wallet/create.json

[
  {
    "request": {
      "body": "{\"Tag\":\"custom meta\",\"Owners\":[\"47401884\"],\"Description\":\"My big project\",\"Currency\":\"EUR\"}",
      "headers": {
        "Authorization": "bearer 3285b058e0fd4c559221549a3aa5072f",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/wallets"
    },
    "response": {
      "binary": false,
      "body": "{\"Description\":\"My big project\",\"Owners\":[\"47401884\"],\"Balance\":{\"Currency\":\"EUR\",\"Amount\":0},\"Currency\":\"EUR\",\"FundsType\":\"DEFAULT\",\"Id\":\"47401890\",\"Tag\":\"custom meta\",\"CreationDate\":1524259675}",
      "headers": {
        "Date": "Fri, 20 Apr 2018 21:27:55 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "195",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=db7577ab9b3534eb1fa7caba64b4868721524259675; expires=Sat, 20-Apr-19 21:27:55 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "262",
        "X-RateLimit-Remaining": "2038",
        "X-RateLimit-Reset": "1524260520",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "40eab2995abcb765-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]