fixture/vcr_cassettes/wallet/create_bis.json

[
  {
    "request": {
      "body": "{\"Tag\":\"custom meta\",\"Owners\":[\"44488751\"],\"Description\":\"My big project\",\"Currency\":\"EUR\"}",
      "headers": {
        "Authorization": "bearer 5dbdeabbc4a0493ab2f56a901339058d",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/wallets"
    },
    "response": {
      "binary": false,
      "body": "{\"Description\":\"My big project\",\"Owners\":[\"44488751\"],\"Balance\":{\"Currency\":\"EUR\",\"Amount\":0},\"Currency\":\"EUR\",\"FundsType\":\"DEFAULT\",\"Id\":\"44488752\",\"Tag\":\"custom meta\",\"CreationDate\":1520378959}",
      "headers": {
        "Date": "Tue, 06 Mar 2018 23:29:20 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "195",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=d7506cabca0655dcae672d62ea6923bf11520378959; expires=Wed, 06-Mar-19 23:29:19 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "147",
        "X-RateLimit-Remaining": "2153",
        "X-RateLimit-Reset": "1520379840",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "3f789a93c9993c77-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]